Revit 2026 API

# DividedSurfaceComponentRotation Property

---

The rotation of the pattern by a multiple of 90 degrees.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ComponentRotation ComponentRotation { get; set; }
```
```vb
Public Property ComponentRotation As ComponentRotation
	Get
	Set
```
```cpp
public:
property ComponentRotation ComponentRotation {
	ComponentRotation get ();
	void set (ComponentRotation value);
}
```
```fsharp
member ComponentRotation : ComponentRotation with get, set
```

#### Property Value

ComponentRotation

This property has no effect unless a pattern is selected (the ObjectType property is not ).

#### Reference

DividedSurface Class

Autodesk.Revit.DB Namespace